# abc_2026
# Федосов Артем


#todo Задача 1. Чтение матрицы, load_matrix(filename)
# Дан файл, содержащий таблицу целых чисел вида (в каждой строке через пробел записаны числа)

# 11 12 13 14 15 16
# 21 22 23 24 25 26
# 31 32 33 34 35 36


# Требуется написать функцию load_matrix(filename) которая загружает эту таблицу из файла.
# Если в каждой строке находится одинаковое количество чисел, функция возвращает список списков целых чисел.
# В противном случае возвращает False.

# Задачу следует решить с использованием списковых включений, циклы использовать НЕЛЬЗЯ!


def load_matrix(filename):
    # Читаем файл и создаем матрицу с помощью спискового включения
    with open(filename, 'r', encoding='utf-8') as file:
        matrix = [[int(x) for x in line.split()] for line in file if line.strip()]

    # Проверяем на пустой файл
    if not matrix:
        return False

    # Получаем список длин всех строк через списковое включение
    lengths = [len(row) for row in matrix]

    # 3. Если в set() осталась только 1 длина - значит все строки равны
    if len(set(lengths)) == 1:
        return matrix
    else:
        return False


# Создаем тестовый файл matrix_26.txt с матрицей
with open('matrix_26.txt', 'w', encoding='utf-8') as f:
    f.write("11 12 13 14 15 16\n")
    f.write("21 22 23 24 25 26\n")
    f.write("31 32 33 34 35 36\n")

# Вызываем функцию и выводим результат
result = load_matrix('matrix_26.txt')
print("Результат загрузки файла c матрицей:")
print(result)
